	title "Блок для работы UART"
	list p=16f887
	include <p16f887.inc>

;	global HH,MM,SS,WD,DD,MO,YY
;	global ReadRTCData, ReadTime, ReadDate, ReadDayofWeek

;	udata

;	udata_ovr

;макросы
;------------------------------------------------------------------

	code
;------------------------------------------------------------------
;- Включение UART
;UART_ON
;------------------------------------------------------------------
;- Выключение UART
;UART_OFF
;------------------------------------------------------------------
;- Установка скорости UART
;SetUARTSpeed(UARTSpeed)
;------------------------------------------------------------------
;- Отправить байт по UART
;SendBytetoUART(UARTbyte)
;------------------------------------------------------------------
;- Отправить пакет (до 64) байт (сохраненных в памяти начиная с указанного адреса) по UART
;SendPackettoUART(ADDR,LEN)
;------------------------------------------------------------------
;- Поместить считанный из UART байт в регистр
;GetUARTByte(ADDR)
;------------------------------------------------------------------
	end